[
  {
    "Content Title": "SketchUp for Architecture",
    "Content Description": "<i>SketchUp for Architecture</i> offers architects the information they need to get the most from SketchUp, the intuitive CAD program for transforming simple drawings into 3D presentations that will impress any client. This installment—the first in a three-part series—kicks off with an overview of the SketchUp interface and workflow and dives into a typical residential building project, taking students from creating the site plan to building the walls, floor, and roof of the house. Instructor Paul J. Smith also shows how to make models more realistic with materials and add believability with landscaping, fixtures, furnishings, and appliances. You can also see how to use styles and how to create the elevations and plans you'll need to complete the rest of the courses in the training series. Plus, learn how to take advantage of organizational features in SketchUp such as layers and components.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2019-11-04 12:51 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning VBA in Excel (2019)",
    "Content Description": "The Visual Basic for Applications (VBA) programming language allows you to automate routine tasks in Excel—and it's not as hard to learn as most people think. In this course, Excel expert Curt Frye offers a crash course on VBA, sharing techniques that can help users of Excel 2007 or later get more out of this powerful program. Curt covers creating subroutines and functions to hold code, and provides a solid grounding in the Excel object model. Programming techniques are demonstrated through real-world examples. Exercise files accompany the course.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2019-11-01 20:37 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning Bash Scripting (2021)",
    "Content Description": "Bash, or the Bourne Again Shell, is a widely popular command-line interpreter for administration and programming tasks. But Bash is different than most scripting languages. That's why Scott Simpson spends some time in this course running you through the syntax—introducing variables, numbers, and control structures—so you can start writing scripts right away. He shows you how to wrap up multiline operations in one file, implement flow control, and interact with users to get input. Plus, he offers challenges along the way that allow you to put what you've learned to the test.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2022-05-25 02:08 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Customer Service: Call Control Strategies",
    "Content Description": "Customer service calls can sometimes get out of control. Upset and overtalkative callers take time and energy away from other customers and tasks. This is where practical call-control strategies come into play. Join customer service trainer Myra Golden as she explains the reasons customer calls get out of hand, and introduces simple strategies to get you back in control. Learn how use a limited response, take control with close-ended questions, assert your way out of a bad conversation, and practice proactive call management so customers feel heard. You’ll leave the course with a variety of actionable tips to turn long, problematic phone calls into polite and efficient interactions.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-06-29 11:24 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Power BI: Dashboards for Beginners",
    "Content Description": "Get a short and simple beginner's guide to Power BI. In this course, Joshua Rischin demystifies the process of building dashboards in Power BI, the powerful business analytics and data visualization tool from Microsoft. Joshua begins with a quick primer on how Power BI dashboards work, demonstrating the building blocks of a successful dashboard. Next, he shows how to select the right data and connect it to your dashboard. Along the way, learn how to prepare and adjust the dashboard’s layout, select and configure a chart type, apply dashboard filters, and enhance the dashboard with finishing touches to wow your stakeholders when you share your review. These lessons make it easier than ever—even if you’re a novice user—to turn raw data into a powerful story that can help drive better business decisions.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2025-03-19 12:38 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Essential Google Cloud Training: Deploy, Analyze, and Secure Your Cloud Environment",
    "Content Description": "<P>This course is designed to introduce the knowledge and skills you will need to deploy infrastructure, develop applications, manage networks, and use specialized services, such as AI and serverless data warehousing on the Google Cloud Platform. Google Cloud expert Dan Sullivan takes you through the essential skills and services you need to get you up and running on the Google Cloud. \n\n</p><P>Throughout the course, Dan uses demos and labs to cement your understanding and provide you with hands-on experience in the Google Cloud Platform. Learn how to start using Google Cloud, how to decide which computing service is right for your needs, how to create virtual machines, and use serverless functions for event driven processing. Dan also explains running containers in Cloud Run and Google Kubernetes Engine, covers hot topics like AI and machine learning on Google Cloud, and explores using Google BigQuery for a wide range of analytics workloads.</p><P>\n \nNote: This course was created by Pearson. We are pleased to host this training in our library.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2025-02-11 20:40 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Autodesk Civil 3D 2021 Essential Training",
    "Content Description": "Autodesk Civil 3D 2021 is a feature-packed design and documentation solution for civil engineering, design, and surveying. By mastering the best-in-class tools within Civil 3D, you can boost your efficiency and effectiveness as a civil engineer, surveyor, or designer. In this course, join instructor Eric Chappell as he helps you get up and running with this powerful software, showing you how to use most of the tools in Civil 3D as you work through a project: a new residential development. Eric demonstrates how to model a surface, lay out parcels, and design road geometry in plan and profile views. Next, he explains how to create corridors, cross-sections, gravity pipe networks, and pressure pipe networks. Then he covers working with feature lines and grading objects, and wraps up by providing an overview of how to analyze and annotate surfaces. Each chapter is full of shortcuts and tips to make your workflow smoother and more efficient.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-09-07 03:22 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Node.js Essential Training (2019)",
    "Content Description": "Node.js is a powerful tool for controlling servers, building web applications, and creating event-driven programs. And it takes JavaScript—a language familiar to all web developers—out of the browser. With Node.js, you can build applications that run on your laptop or even the cloud. In this course, learn the essentials of Node.js and start creating your own JavaScript applications. Instructor Alex Banks acquaints you with all of the basics, showing how to install Node.js and work with the Node.js core, which includes standard input, standard output, the module system, the file system, and how to write and run JavaScript on the server. Upon wrapping up this course, you’ll be equipped with fundamental Node.js concepts and techniques that you can put to use in your next project.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-03-30 17:05 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Python: Design Patterns (2015)",
    "Content Description": "Design patterns encourage programming efficiency and code reuse. This course is a look at traditional design patterns as applied to Python. Jungwoo Ryoo covers 15 essential creational, structural, and behavioral patterns to help you solve common coding challenges, while introducing best practices that will keep your solutions consistent, complete, and correct.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2020-05-19 17:52 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning Java (2018)",
    "Content Description": "Java is one of the top five programming languages, and is used for websites, embedded controllers, and Android app development. This is an introduction to get you started programming with Java 9-and the newly introduced JShell. Instructor Kathryn Hodge covers all the basics: data types, strings, arrays, loops, and functions. She helps you control the flow and logic of your code, and debug your project to make sure it runs perfectly. Then go a bit beyond the basics and learn advanced techniques such as encapsulation, inheritance, functional programming, and lambdas. Kathryn introduces challenges along the way to practice your new skills. This three-hour course is perfect for developers who need to get up to speed with Java fast, as well as for beginning programmers who want their first taste of this popular language.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2020-03-21 17:38 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Java 8+ Essential Training: Objects and APIs",
    "Content Description": "If you want to build applications for mobile devices, desktop computers, or the web, you need to know Java—and keep your knowledge up to date as the language evolves. Java 9 is changing quite a few important aspects of the programming workflow, particularly the handling of objects and APIs. This course is the second in the <i>Java Essential Training</i> series, which provides the foundation for learning Java 9. Instructor David Gassner starts by showing how to debug Java code in IntelliJ IDEA, and handle any exceptions that occur. He explains how to create custom classes and understand how Java implements inheritance, a core principle of object-oriented programming. Plus, learn how to store data in memory with the Java Collections Framework, extend Java with popular APIs, make network requests, and package your applications for deployment in JAR files.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2020-04-25 13:19 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "SOLIDWORKS: Designing for Consumer Electronics",
    "Content Description": "Consumer electronics are all around us, and new products are created every year. In this course, instructor Johno Ellison teaches the basics of designing these items in SOLIDWORKS. Through this project-based course, he shows you how to design a game controller using SOLIDWORKS features like lofts, fillets, mirroring, and shell. Course projects include creating an assembly, adding fastening details, and even creating the buttons, joystick, and printed circuit board that go into the controller. Johno concludes with a discussion of development and potential next stages in the design process.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-06-07 02:37 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "CATIA V5: Class A Surfacing",
    "Content Description": "Class A surface modelers are called digital sculptors for a reason: the Class A surface represents the absolute peak of styling for freeform surfaces. For this reason, the Class A technique is used to design automobiles, high-end products like mobile phones, and aerospace craft, where the shapes must be of the highest quality. This course introduces the concepts behind Class A surfacing, including an explanation of key terms and their roots in shipbuilding history. You also learn the fundamentals of Class A surfacing design—from deriving curves to creating mesh surfaces—and find out how to implement these techniques in CATIA V5, a leading CAD platform. Instructor Steven Marjieh also shows how to assemble the final form, and perform an analysis to ensure your designs meet the original engineering and styling intents.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-10-08 19:19 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "JavaScript: Maps and Sets",
    "Content Description": "Programming languages are always evolving and changing, and JavaScript is no exception. Over time, JavaScript has grown, and many new aspects have been added, including maps and sets. JavaScript maps and sets may sound simple, but they aren't quite the same as their counterparts in other programming languages. In this course, software engineer Jamie Pittman covers the ins and outs of JavaScript maps and sets, their syntax, how they work, and how to integrate them into your daily coding practice. Topics covered include a general overview of these features, when and where to use them, their WeakMap and WeakSet versions, and the various methods and properties associated with them. Practice what you learn with hands-on challenges.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2022-08-18 12:31 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Advanced Java Programming",
    "Content Description": "Want to get more out of the Java language and platform? In this platform- and framework-neutral course, instructor Bethan Palmer digs into some of the language’s more advanced features, helping you expand your programming skills as she equips you with techniques you can use when building applications anywhere Java is used: in web, mobile, and desktop applications. Bethan covers a variety of topics, including generics, working with the Collections Framework, and functional programming. Plus, learn about I/O in Java, working with files and directories, and structuring applications using the modular system available in Java.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-12-09 22:58 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Arduino: Prototyping",
    "Content Description": "For designers and product managers, the Arduino family of microcontrollers and easy-to-assemble components is a valuable tool for exploring and evaluating hardware product designs. Rapid, incremental prototypes can help improve outcomes and reduce cost and time in the design process. In this course, instructor Robert Gallup helps you go beyond the basics and learn what it takes to develop Arduino-based prototypes. Robert begins by providing an overview of the prototype development process, highlighting both best practices and potential pitfalls. He then steps through how to develop and refine a proof-of-concept prototype, introducing relevant concepts and techniques along the way. After this course, you'll be ready to tackle your own hardware prototyping using Arduino. <br>\nRobert also includes several hands-on challenges with solutions to help you better understand the LCD, animation dynamics, and the final process of completing your prototype and modifying it in response to feedback.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2023-03-17 14:46 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning Personal Branding",
    "Content Description": "You are the most powerful marketing tool at your disposal. If you are starting a business, establishing your thought leadership, or trying to get ahead in your career, it's a great time to start investing in the brand of you. Learn the secrets of personal branding in this course with marketing expert Chelsea Krost. Chelsea explains how to develop your story, craft your messaging, and define your audience. Then she walks you through building your brand presence online and off, creating a calendar that will help you stay on top of social media and keep your content fresh. Plus, get tips to monetize your personal brand and land speaking engagements and guest roles.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-04-25 01:18 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Blender 2.8 Essential Training",
    "Content Description": "Blender is a powerful open-source solution for 2D and 3D modeling, animation, compositing, and post-production. Get a beginner-level introduction to the toolset in Blender 2.8, in this introductory course with David Andrade. David provides a thorough overview of the Blender feature set, as well as practical production techniques that combine know-how with a healthy dose of how-to.  He dives into specific techniques, such as scene layout and modeling, sculpting, texturing and shading, 2D and 3D animation, dynamic simulations, rendering, and video effects (VFX). Plus, get performance-boosting tricks to get Blender to render your creations even faster. Each lesson helps you gain the control and skill you need to create professional artwork for multiple platforms: games, movies, and animation.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2020-12-10 14:40 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning SQL Programming",
    "Content Description": "<p>Structured Query Language (SQL) is a common tool for retrieving data from relational databases such as SQL Server, MySQL, MariaDB, and PostgreSQL. This course provides an introduction to this core programming language. Learn how to request data from a database, limit and sort the responses, aggregate data from multiple tables with joins, and edit and delete data. Instructor Scott Simpson also shows how to perform simple math operations and transform data into different formats. </p><p>This course is part of a <a href=\"https://www.linkedin.com/learning/paths/data-engineering-foundations-professional-certificate-by-astronomer\" target=\"_blank\">Professional Certificate</a> from Astronomer.</p>",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-10-19 01:02 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Practice Exam 4 for CompTIA A+ (220-1101)",
    "Content Description": "<p>This practice exam is intended to help you prepare for the <b>CompTIA A+ (220-1101)</b> certification exam. After you launch the practice exam, there are three practice modes available; timed, untimed, or custom. Each mode allows unlimited attempts, explanations for correct and incorrect answers, and detailed exam results. The number and types of questions on the practice exam and the duration of the timed practice exam is intended to be representative of the certification exam.</p><p><b>Want more practice?</b> Additional practice exams for this certification are available and each has a unique question set for continued preparation.</p>\n<ul>\n<li><a href=\"https://www.linkedin.com/learning/practice-exam-1-for-comptia-a-plus-220-1101/\" target=\"_blank\">Practice Exam 1 for CompTIA A+ (220-1101)</a></li>\n<li><a href=\"https://www.linkedin.com/learning/practice-exam-2-for-comptia-a-plus-220-1101/\" target=\"_blank\">Practice Exam 2 for CompTIA A+ (220-1101)</a></li>\n<li><a href=\"https://www.linkedin.com/learning/practice-exam-3-for-comptia-a-plus-220-1101/\" target=\"_blank\">Practice Exam 3 for CompTIA A+ (220-1101)</a></li>\n</ul>\n<p><b>About the certification</b>: To learn more about this certification, visit <a href=\"https://www.comptia.org/certifications/security#examdetails\"><b>CompTIA</b></a>.<p><I>The practice exam questions provided are representative of the certification exam, but not the actual questions you will see on the certification exam. Practice exams are for self-assessment. Passing this practice exam does not guarantee that you will pass the actual certification exam.</I></p>",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2024-04-22 15:29 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Go Practice: Concurrency",
    "Content Description": "<p>Being proficient in concurrency can enhance your employability as a developer. With the rise of multi-core devices, being able to write code that executes multiple tasks simultaneously is becoming a crucial concept in modern programming. One of the most attractive aspects of Go for developers is its built-in concurrency, and in this course, Miki Tebeka tests your Go concurrency skills with a series of challenges. Learn to work with goroutines, channels, and even lower-level concurrency primitives like sync.Mutex. Follow along with Miki, compare your solutions to his, and see how your concurrency skills match up.</p><p>\nThis course includes Code Challenges powered by CoderPad. Code Challenges are interactive coding exercises with real-time feedback, so you can get hands-on coding practice alongside the course content to advance your programming skills.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2025-02-20 18:06 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Microsoft Power Platform Fundamentals (PL-900) Cert Prep: 1 The Business Value of Power Platform by Microsoft Press",
    "Content Description": "<p>Enhance your skills to prepare for the PL-900 exam by learning the basics of the Microsoft Power Platform. Developers of all levels can benefit from the Microsoft Power Platform Fundamentals (PL-900) certification, which vets your ability to leverage Power Platform to improve processes, performance, and business outcomes. In this course—the first in a six-part series designed to familiarize you with the various tools, applications and services included in the Power Platform suite—instructor Craig Zacker covers the Microsoft Dataverse, connectors, Power BI for data visualization, developing apps with Power Apps, automation with Power Automate, and chatbots with Power Virtual Agents. By the end of this course, you’ll have the skills required to start creating your own applications and automated processes to continue to prepare for the PL-900 exam.</p><p>This course was created by Microsoft Press. We are pleased to host this content in our library.</p>",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2024-11-21 18:27 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Maya 2024 Essential Training",
    "Content Description": "Discover how to create high-quality 3D models and animations in Maya 2024. This course covers the core Maya skills—modeling, texturing, rendering, and animation—in a real-world, project-based workflow that translates equally well to film, motion graphics, and game design. Learn basics such as customizing the interface, selecting and manipulating objects, and organizing scenes. Next, review polygonal modeling, creating and refining meshes, sculpting, smoothing, working with curves, and more. Discover how to create and apply materials to surfaces—adding color, texture, and reflectivity—as well as integrate cameras, lighting, and depth-of-field effects using the Arnold for Maya renderer. Last but not least, instructor George Maestri shows you how to add movement and life to your work with the built-in Maya animation tools.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2025-04-10 02:40 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Python Code Challenges ",
    "Content Description": "Want to test your Python skills? These concise challenges let you stretch your brain and test your talents. Instructor Barron Stone shares over a dozen Python challenges, as well as his own solutions to each problem—the majority of which are less than two dozen lines of code. You can tackle each problem using the tools in the Python standard library, or opt for the library of your choice. And since each challenge is self-contained, you can complete the course in any order—and at your own pace. Tune in to get the hands-on practice you need to keep your skills sharp.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2022-07-07 23:08 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Quick Start Guide to SQL",
    "Content Description": "Are you looking to take a deeper dive into the fundamentals of structured query language (SQL)? This short, beginner-friendly course is just the place to start. Join instructor Deepa Maddala as she walks you through the basics of SQL and how to make it work seamlessly with large Oracle datasets.<br><br>Learn about relational database management systems, SQL, and how it works. Explore strategies that you can put to use fetching data from tables, filtering data, and manipulating data with single-row and multiple-row functions, as well as joins and subqueries. By the end of this course, you’ll not only have a deeper understanding of the basic concepts of SQL—you’ll also be ready to get started working on real-time business scenarios.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2023-06-07 15:56 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "SOLIDWORKS: Modeling Gears",
    "Content Description": "Do you need to design and build gears for work, study, or a hobby? In this course, instructor Ryan Krawchuk covers the basics of mechanical gears, gives a hands-on lesson on modeling a spur gear using SOLIDWORKS, and then describes how to create a simple assembly. Ryan begins with a description of spur gears, helical gears, and others gears, as well as their respective applications. He covers key gear design attributes and nomenclature. Ryan steps you through spur gear equations, for both metric and English measurement systems, then goes through each step in modeling a spur gear. Once your gear model is complete, he shows you how to design the mounting plate that gears sit on, how to insert gears and mounting plates into your assembly, and how to use concentric and coincident gear mates. He discusses how to use a series of gear mates to allow gears to rotate dynamically to one another, then concludes by showing you how to animate your assembly with a SOLIDWORKS motion study.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-05-22 15:38 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Advanced Python: Build Hands-On Projects with Design Patterns (2023)",
    "Content Description": "Looking to get up to speed with design patterns in Python? This course was made for you. Join instructor Jungwoo Ryoo in this hands-on, interactive, skills-first coding course designed uniquely for advanced-level Python developers. Discover strategic Python coding skills to boost your technical know-how, prepare for an interview, or land a new role. This course includes Code Challenges powered by CoderPad: interactive coding exercises with real-time feedback, so you can get hands-on coding practice to advance your coding skills as you go. Along the way, Jungwoo helps you develop your skills as a Python programmer with four specific, design-focused coding challenges to enhance your programming efficiency, consistency, completeness, and correctness by implementing patterns. Practice building complex objects with the Builder pattern, building a wrapper with the Adapter pattern, building a transaction with the Command pattern, and improving security with the intercepting validator.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2024-08-09 20:50 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Designing Dynamic Layouts with Text and Dialog in Comics",
    "Content Description": "Layout begins with two pieces: an illustrated comic and a script. It ends with a dynamic design where both words and action leap off the page. This balance—between text and images—is essential for new artists to master. Here professional comic creator Ben Bishop shares his techniques for laying out narration, dialog, and sound effects in a comic book. He reviews the different terms (speech balloons, captions, panels, gutters, sound effects, etc.) and then shows examples of how to use these devices, with pages from some of his favorite artists' work. Then he goes through the different options available when adding text to a comic page, using the same script in different ways and exploring what different treatments do to the story. These exercises illustrate the most effective and impactful compositions and design options when laying out the text on the illustrated page.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2019-11-07 12:13 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "CONTENT METADATA NO LONGER EXISTS - urn:li:lyndaCourse:2806032",
    "Content Description": "CONTENT METADATA NO LONGER EXISTS - urn:li:lyndaCourse:2806032",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2019-11-03 14:23 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Learning C++ (2021)",
    "Content Description": "C++ is one of the most powerful and widely used programming languages of all time. It is also one of the oldest programming languages in use today. In this course, learn the basic elements of this object-oriented programming language that moves the world. Instructor Eduardo Corpeño begins with setting up the development environment and introducing the basic elements of object-oriented programming. Eduardo covers data types such as variables, expressions, assignments, constants, and more. He explains structures, classes, pointers, vectors, and so on. After stepping through the control flow process and a variety of useful functions, Eduardo finishes up with detailed information on opening and working with files.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2023-01-07 00:18 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Fusion 360: Designing for Metal",
    "Content Description": "If you're designing metal parts, you'll need to do things differently than you would for other materials and processes. This course shows how to use Autodesk Fusion 360—the affordable cloud-powered CAD and CAM tool that works like more expensive, industry-focused tools—to build effective designs specifically for subtractive manufacturing in metal. Thom Tremblay shows how to build solid designs, simulate how the model will hold up to the stress of production and use, render the design for presentation, and finalize it for manufacturing. The workflows showcased in this course are tailored to help the nonprofessional CAD user, and the maker, to be more effective and quickly have access to the tools that a few years ago were only available to the few and at an astronomical price.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2021-08-25 03:13 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  },
  {
    "Content Title": "Nano Tips for Effortless Influence with Shadé Zahrai",
    "Content Description": "Welcome to our Nano Tips series, where LinkedIn Learning creators deliver impactful lessons in literally seconds. In this course, peak performance researcher and behavioral strategist to Fortune 500 companies Shadé Zahrai shows you how to exude effortless influence. She starts with outlining the basics of influence, followed by sharing key influence tactics—leveraging social proof, offering choices, and influencing with emotional intelligence. Shadé then takes it up a level with some pro-level influence techniques, explaining how to influence those with greater authority and how to sway skeptics.",
    "Content Type": "Course",
    "Content Last Watched Date (if viewed)": "2025-01-30 19:32 UTC",
    "Content Completed At (if completed)": "N/A",
    "Content Saved": "false",
    "Notes taken on videos (if taken)": "N/A",
    "": ""
  }
]