[
  {
    "Company Name": "Axle Informatics",
    "Title": "Full-stack Developer",
    "Description": "Developed and maintained scalable full-stack applications and system integrations using D3.js, Angular, Loopback, NestJS, SharePoint, and PostgreSQL, improving data accessibility and reducing project vulnerabilities. Led the planning, execution, and optimization of SharePoint on-premise to SharePoint Online migrations, ensuring zero downtime and enhancing collaboration for 200+ users by leveraging SharePoint Add-ins and Active Directory (AAD) for seamless authentication. Designed and implemented an Approval Request System using PowerApps, Power Automate, and SharePoint, cutting approval processing time by ~50% and enabling real-time tracking for 400+ requests annually. Architected Power Platform solutions using Azure On-Premise Data Gateway, Azure Key Vault, and RESTful APIs, enabling secure on-premise resource access without requiring premium Power Automate connectors, reducing licensing costs by ~$50,000–$200,000 annually.",
    "Location": "United States",
    "Started On": "Aug 2023",
    "Finished On": ""
  },
  {
    "Company Name": "Axle Informatics",
    "Title": "Power Platform Developer",
    "Description": "Designed and deployed a centralized request management system for publication and presentation approvals at Axle Informatics, automating grant approval workflows and reducing processing time by ~40%. Developed and deployed a Monthly Status Report Management system, automating reporting workflows and reducing manual workload by ~35%, ensuring consistent submissions and streamlined communication between Axle Informatics and federal agencies. Collaborated with cross-functional teams to automate business processes, reducing administrative overhead by ~30% through Power Automate-based workflow optimizations.",
    "Location": "United States",
    "Started On": "Feb 2022",
    "Finished On": "Aug 2023"
  },
  {
    "Company Name": "Axle Informatics",
    "Title": "Computer Science Trainee",
    "Description": "Created interactive dashboards and web applications using Node.js, Express, Angular, and Loopback, enabling real-time data visualization and improving enterprise application features. Developed features for a user resource management system prototype, allowing users to assign permissions to resources in a proprietary authentication system. Enhanced application performance by implementing caching and optimizing queries, reducing load times by ~30% for Angular and Express applications.",
    "Location": "United States",
    "Started On": "Oct 2021",
    "Finished On": "Feb 2022"
  }
]